/*************************************************/
//初始化GPIO
/**************************************************
PxSEL=0时：管脚为I/O功能
PxDIR=0时：管脚为输入功能
PxREN=1时：启用上拉/下拉电阻
PxOUT=1时：管脚输出H电平、启动上拉电阻
***************************************************/

void GPIO_Init()
{
	P1SEL &= ~(BIT0 + BIT3 + BIT6);			
	P1DIR |= BIT0 + BIT6;
	P1DIR &= ~BIT3;
	P1REN |= BIT3;
}

/*************************************************/
//初始化IO中断
/**************************************************
PxIE=1时：允许IO中断
PxIES=1时：下降沿触发IO中断
PxIFG=0时：清0中断Px标志位
***************************************************/

void GPIO_Interrupt_Init()
{
	P1IE |= BIT3;
	P1IES |= BIT3;
	P1IFG = 0;
}

/*************************************************/
//设定IO中断函数
/*************************************************/
#pragma vector=PORT1_VECTOR
__interrupt void P1_Interrupt()
{
	int key = P1IN & P1IFG;
	Delay_us(500);
	if (key == (P1IN & BIT3))		//判断P1.3是否产生中断
	{
		Delay_us(500);
		key = P1IN & P1IFG;
		if (key == (P1IN & BIT3))		//再次判断是否按下
		{
			P1OUT ^= (BIT0 + BIT6);
		}
	}
	P1IFG = 0;
}
